[
  {
    "title": "Niat Umroh",
    "arabic": "اَللَّهُمَّ لَبَّيْكَ عُمْرَةً",
    "latin": "Allahumma Labbaika Umroh",
    "translation": "Ya Allah aku memenuhi panggilanMu untuk umroh.",
    "notes": null,
    "fawaid": "Berihram dari miqot dan membaca niat",
    "source": ""
  },
  {
    "title": "Niat Haji",
    "arabic": "اَللَّهُمَّ لَبَّيْكَ حَجًّا",
    "latin": "Allahumma labbaika hajjan",
    "translation": "Ya Allah aku memenuhi panggilanmu untuk berhaji.",
    "notes": null,
    "fawaid": "Berihram dari miqot dan membaca niat",
    "source": ""
  },
  {
    "title": "Jika khawatir tidak dapat menyelesaikan umrah karena sakit atau adanya penghalang lain",
    "arabic": "اللَّهُمَّ مَحِلِّي حَيْثُ حَبَسْتَنِي",
    "latin": "allahummaAllahumma mahilli haitsu habastani",
    "translation": "Ya Allah, tempat tahallul di mana saja Engkau menahanku.",
    "notes": null,
    "fawaid": "Dengan mengucapkan persyaratan ini—baik dalam umrah maupun ketika haji–, jika seseorang terhalang untuk menyempurnakan manasiknya, maka dia diperbolehkan bertahallalul dan tidak wajib membayar dam (menyembelih seekor kambing).",
    "source": ""
  },
  {
    "title": "Bacaan Talbiyah",
    "arabic": "لَبَّيْكَ اللَّهُمَّ لَبَّيْكَ، لَبَّيْكَ لاَ شَرِيْكَ لَكَ لَبَّيْكَ، إِنَّ الْحَمْدَ وَالنِّعْمَةَ لَكَ وَالْمُلْكَ لاَ شَرِيْكَ لَكَ",
    "latin": "Labbaikallaahumma labbaik, labbaika laa syariika laka labbaik, innal hamda wan-ni’mata laka wal mulk, laa syariika lak.",
    "translation": "Aku memenuhi panggilanMu ya Allah, aku memenuhi panggilanMu. Aku memenuhi panggilanMu, tiada sekutu bagiMu, aku memenuhi panggilanMu. Sesungguhnya pujaan dan nikmat adalah milikMu, begitu juga kerajaan, tiada sekutu bagiMu.",
    "notes": null,
    "fawaid": "Membaca dan memperbanyak talbiah di atas, sambil mengeraskan suara bagi laki-laki dan lirih bagi perempuan hingga tiba di Makkah",
    "source": "HR. Al-Bukhari dengan Fathul Bari 3/408, Muslim 2/841"
  },
  {
    "title": "Doa masuk masuk kota Mekah",
    "arabic": "اَللَّهُمَّ رَبَّ السَّمَاوَاتِ السَّبْعِ وَمَا أَظْلَلْنَ، وَرَبَّ اْلأَرَضِيْنَ السَّبْعِ وَمَا أَقْلَلْنَ، وَرَبَّ الشَّيَاطِيْنِ وَمَا أَضْلَلْنَ، وَرَبَّ الرِّيَاحِ وَمَا ذَرَيْنَ. أَسْأَلُكَ خَيْرَ هَـٰذِهِ الْقَرْيَةِ وَخَيْرَ أَهْلِهَا، وَخَيْرَ مَا فِيْهَا، وَأَعُوْذُ بِكَ مِنْ شَرِّهَا وَشَرِّ أَهْلِهَا وَشَرِّ مَا فِيْهَا",
    "latin": "Allaahumma robbas-samaawaatis-sab’i wa maa azhlalna, wa robbal arodhiinas-sab’i wa maa aqlalna, wa robbasy-syayaathiini wa maa adhlalna, wa robbar-riyaahi wa maa dzaroina. As-aluka khoiro haadzihil quryati wa khoiro ahlihaa, wa khoiro maa fiihaa, wa a’uudzu bika min syarrihaa wa syarri ahlihaa wa syarri maa fiihaa.",
    "translation": "Ya Allah, Tuhan tujuh langit dan apa yang dinaunginya, Tuhan penguasa tujuh bumi dan apa yang di atasnya, Tuhan yang menguasai setan-setan dan apa yang mereka sesatkan, Tuhan yang menguasai angin dan apa yang diterbangkannya. Aku mohon kepadaMu kebaikan desa ini, kebaikan penduduknya dan apa yang ada di dalamnya. Aku berlindung kepadaMu dari kejelekan desa ini, kejelekan penduduknya dan apa yang ada di dalamnya.",
    "notes": null,
    "fawaid": "",
    "source": "HR. Al-Hakim, menurut pendapatnya, hadits tersebut adalah sahih. Imam Adz-Dzahabi menyetujuinya 2/100, Ibnus Sunni, no. 524. Menurut Al-Hafizh Ibnu Hajar dalam Takhrij Adzkar 5/154: “Hadits tersebut adalah hasan.” Bin Baz berkata: Hadits itu diriwayatkan pula oleh An-Nasai dengan sanad yang hasan. Lihat Tuhfatul Akhyar, hal. 37"
  },
  {
    "title": "Doa masuk masjidil haram",
    "arabic": "أَعُوْذُ بِاللَّهِ الْعَظِيْمِ، وَبِوَجْهِهِ الْكَرِيْمِ، وَسُلْطَانِهِ الْقَدِيْمِ، مِنَ الشَّيْطَانِ الرَّجِيْمِ، (بِسْمِ اللَّهِ، وَالصَّلاَةُ) (وَالسَّلاَمُ عَلَى رَسُوْلِ اللَّهِ) اَللَّهُمَّ افْتَحْ لِيْ أَبْوَابَ رَحْمَتِكَ(",
    "latin": "A’uudzu billaahil ‘azhiim, wa biwajhihil kariim, wa sulthoonihil qodiim, minasy-syaithoonir-rojiim, (bismillaah, wash-sholaaatu) (was-salaamu ‘alaa rosuulillaah) allaahummaftah lii abwaaba rohmatik.",
    "translation": "Aku berlindung kepada Allah Yang Maha Agung, dengan wajahNya Yang Mulia dan kekuasaanNya yang abadi, dari setan yang terkutuk [1] Dengan nama Allah dan semoga shalawat [3] dan salam tercurahkan kepada Rasulullah [3]Ya Allah, bukalah pintu-pintu rahmatMu untukku[4].",
    "notes": null,
    "fawaid": "",
    "source": "[1]HR. Abu Dawud, lihat Shahih Al-Jami’ no.4591. [2]HR. Ibnu As-Sunni no.88, dinyatakan Al-Albani “hasan”. HR. Abu Dawud, lihat Shahih Al-Jami’ 1/528. [3]HR. Muslim 1/494. [4]Dalam Sunan Ibnu Majah, dari hadits Fathimah “Allaahummagh fir li dzunubi waftahli abwaba rahmatik”, Al-Albani menshahihkannya karena beberapa shahid. Lihat Shahih Ibnu Majah 1/128-129"
  },
  {
    "title": "Doa ketika melihat ka’bah",
    "arabic": "اللهُمَّ أَنْتَ السَّلَامُ وَمِنْكَ السَّلَامُ، فَحَيِّنَا رَبَّنَا بِالسَّلَامِ",
    "latin": "Allahumma antas salaam wa minkas salaam fahayyinaa rabbanaa bis salaam",
    "translation": "Ya Allah sesungguhnya Engkau adalah As-Salaam (Yang suci/selamat dari segala aib dan kekurangan), dan dariMu-lah keselamatan, maka sambutlah kami wahai Rab kami dengan keselamatan.",
    "notes": null,
    "fawaid": "Saíd bin al-Musayyib rahimahullah (seorang ulama tabiín) jika masuk ke masjidil haram dan melihat ka’bah maka beliau membaca doa diatas.",
    "source": "Atsar riwayat Ibnu Abi Syaibah di al-Mushonnaf  7/102 dan al-Baihaqi di As-Sunan al-Kubro 5/73 dengan sanad yang shahih"
  },
  {
    "title": "Bertakbir Setiap Datang Ke Hajar Aswad",
    "arabic": "",
    "latin": "",
    "translation": "",
    "notes": null,
    "fawaid": "Nabi Shallallahu’alaihi wasallam melakukan tawaf di Baitullah, di atas unta, setiap datang ke Hajar Aswad (tiang Ka’bah yang terdapat Hajar Aswad), beliau memberi isyarat dengan sesuatu yang dipegangnya dan bertakbir.",
    "source": "HR. Al-Bukhari dengan Fathul Bari 3/476, maksud “sesuatu” adalah tongkat. Lihat Al-Bukhari dengan Fathul Bari 3/472"
  },
  {
    "title": "Doa Menuju Maqom Ibrahim",
    "arabic": "وَاتَّخِذُوا مِنْ مَقَامِ إِبْرَاهِيمَ مُصَلًّى",
    "latin": "Wattakhidzuu mim maqoomi ibraahiima musholla.",
    "translation": "Dan jadikanlah sebahagian maqom Ibrahim sebagai tempat shalat” (QS Al-Baqoroh : 125).",
    "notes": null,
    "fawaid": "Disunahkan shalat sunnah di belakang maqom Ibrahim",
    "source": ""
  },
  {
    "title": "Doa Minum Air Zamzam",
    "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْمًا نَافِعًا وَرِزْقًا وَاسِعًا وَشِفَاءً مِنْ كُلِّ دَاءٍ",
    "latin": "Allahumma inni as aluka ílman naafián wa rizqon waasián wa syifaan min kulli daa in",
    "translation": "Ya Allah sesungguhnya aku memohon kepadaMu ilmu yang bermanfaat, rizki yang lapang, dan kesembuhan dari segala penyakit.",
    "notes": null,
    "fawaid": "Tidak ada doa khusus yang datang dari Nabi, silahkan berdoa dengan doa apa saja karena Nabi shallallahu álaihi wasallam bersabda, “Air zamzam untuk niat meminumnya”. Akan tetapi diriwayatkan dari Ibnu Ábbas ketika minum zamzam ia berdoa dengan doa diatas.",
    "source": "HR Ad-Daruqhutni dalam sunannya no 2738, akan tetapi dinilai dhoíf oleh Al-Albani di al-Irwaa’ 4/333 karena pada sanadnya ada perawi yang bernama Al-Hakam yaitu Ibnu Abaan al-Ádani"
  },
  {
    "title": "Doa Di Atas Bukit Shafa",
    "arabic": "اَ إِلَـٰهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيْكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيْرٌ، لاَ إِلَـٰهَ إِلاَّ اللَّهُ وَحْدَهُ أَنْجَزَ وَعْدَهُ وَنَصَرَ عَبْدَهُ وَهَزَمَ اْلأَحْزَابَ وَحْدَهُ",
    "latin": "Innash-shofaa wal marwata min sya’aa-irillah. Abda-u bimaa bada-allaahu bih.",
    "translation": "Sesungguhnya Shafa dan Marwah adalah termasuk sy’iar agama Allah. Aku memulai sa’i dengan apa yang didahulukan oleh Allah.",
    "notes": null,
    "fawaid": "Ketika Nabi Shallallahu’alaihi wasallam dekat dengan bukit Shafa, beliau membaca doa diatas.",
    "source": ""
  },
  {
    "title": "Doa Di Atas Bukit Marwah",
    "arabic": "اَ إِلَـٰهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيْكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيْرٌ، لاَ إِلَـٰهَ إِلاَّ اللَّهُ وَحْدَهُ أَنْجَزَ وَعْدَهُ وَنَصَرَ عَبْدَهُ وَهَزَمَ اْلأَحْزَابَ وَحْدَهُ",
    "latin": "Allahuakbar (3x).Laa ilaaha illallaah, wahdahu laa syariika lah, lahul mulku wa lahul hamd, wa huwa ‘alaa kulli syai-in qodiir, laa ilaaha illallaahu wahdah, anjaza wa’dah, wa nashoro ‘abdah, wa hazamal ahzaaba wahdah.",
    "translation": "Allah Maha Besar. Tidak ada sesembahan yang berhak disembah kecuali Allah, Yang Maha Esa, Tiada sekutu bagiNya. BagiNya kerajaan dan pujian. Dialah Yang Mahakuasa atas segala sesuatu. Tidak ada sesembahan yang berhak disembah kecuali Allah, Yang Maha Esa, yang melaksanakan janjiNya, membela hambaNya (Muhammad) dan mengalahkan golongan musuh sendirian.",
    "notes": null,
    "fawaid": "Nabi Shallallahu’alaihi wasallam mulai dengan naik ke bukit Shafa, hingga beliau melihat Ka’bah (jika memungkinkan). Lalu menghadap kiblat, membaca kalimat tauhid, bertakbir 3x, lalu membaca doa diatas. Kemudian beliau berdoa. Beliau membacanya (dzikir di atas dan doa) sebanyak 3x. Di dalam hadits tersebut dikatakan, Nabi Shallallahu’alaihi wasallam juga membaca di Marwah sebagaimana beliau membaca di Shafa.",
    "source": "HR. Muslim 2/888"
  },
  {
    "title": "Saat Berada Di Area Lampu Hijau",
    "arabic": "اللَّهُمَّ اغْفِرْ وَارْحَمْ وَأَنْتَ الأَعَزُّ الأَكْرَمُ",
    "latin": "Allahummaghfirli warham wa antal a’azzul akrom",
    "translation": "Ya Rabbku, ampuni dan rahmatilah aku. Sesungguhnya Engkaulah Yang Maha Perkasa dan Maha Pemurah.",
    "notes": null,
    "fawaid": "Ketika sa’i, tidak ada dzikir-dzikir tertentu, maka boleh berdzikir, berdo’a, atau membaca bacaan-bacaan yang dikehendaki. Tidaklah mengapa membaca doa diatas karena telah diriwayatkan dari ‘Abdullah bin Mas’ud dan ‘Abdullah bin ‘Umar radhiyallahu ‘anhuma bahwasanya mereka membacanya ketika sa’i.",
    "source": "HR. at-Tirmidzi"
  },
  {
    "title": "Doa Pada Hari Arafah(Haji)",
    "arabic": "لاَ إِلَـٰهَ إِلاَّ اللَّهُ، وَحْدَهُ لاَ شَرِيْكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيْرٌ",
    "latin": "Laa ilaaha illallaah, wahdahu laa syariika lah, lahul mulku wa lahul hamd, wa huwa ‘alaa kulli syai-in qodiir.",
    "translation": "Tidak ada sesembahan yang berhak disembah kecuali Allah, Yang Maha Esa, tiada sekutu bagi-Nya. Bagi-Nya kerajaan dan bagi-Nya pujian. Dan Dia Maha Kuasa atas segala sesuatu.",
    "notes": null,
    "fawaid": "Nabi Shallallahu’alaihi wasallam bersabda: Doa yang terbaik (yang mustajab) adalah di hari Arafah, dan sebaik-baiknya apa yang aku dan para nabi baca.",
    "source": "HR. At-Tirmidzi dan lihat Shahih At-Tirmidzi 3/ 184. Al-Albani menyatakan, hadits tersebut adalah hasan. Lihat pula Al-Ahaditsush Shahihah lil-Albani 4/6"
  },
  {
    "title": "Bacaan di Masy’aril Haram (Muzdalifah)(Haji)",
    "arabic": "",
    "latin": "",
    "translation": "",
    "notes": null,
    "fawaid": "Setelah sholat subuh Nabi Shallallahu’alaihi wasallam menghadap kiblat, berdoa, membaca takbir dan tahlil serta kalimat tauhid. Beliau terus berdoa hingga fajar menyingsing. Kemudian beliau berangkat (ke Mina) sebelum matahari terbit.",
    "source": "HR. Muslim 2/891"
  },
  {
    "title": "Bertakbir Setiap Melempar Jumrah (Haji)",
    "arabic": " اللهُ أَكْبَرُ ",
    "latin": "Allahuakbar",
    "translation": "Allah Maha Besar.",
    "notes": null,
    "fawaid": "Rasulullah Shallallahu’alaihi wasallam bertakbir pada setiap melempar tiga Jumrah dengan batu kecil, kemudian beliau maju dan berdiri untuk berdoa dengan menghadap kiblat dan mengangkat kedua tangannya setelah melempar Jumrah yang pertama dan kedua. Adapun untuk Jumrah Aqabah, beliau melempar dan bertakbir, dan beliau tidak berdiri di situ, tapi langsung pergi (tidak berdoa)",
    "source": "HR. Al-Bukhari dengan Fathul Bari 3/583, 3/584 dan 3/581. Muslim juga meriwayatkannya"
  },
  {
    "title": "Doa Arafah #1",
    "arabic": "ررَبَّنَآءَامَنَّافَٱغۡفِرۡلَنَاوَٱرۡحَمۡنَاوَأَنتَخَيۡرُٱلرَّٰحِمِينَ",
    "latin": "rabbana amanna fa-igh'fir lana wa-ir'hamna wa-anta khayru al-rahimina",
    "translation": "Ya Tuhan kami, kami telah beriman, maka ampunilah kami dan berilah kami rahmat, Engkau adalah pemberi rahmat yang terbaik",
    "notes": null,
    "fawaid": "",
	"source": "QS. Al-Mu'minun 109"
  },
  {
    "title": "Doa Arafah #2",
    "arabic": "رَبَّنَاٱغۡفِرۡلَنَاذُنُوبَنَاوَإِسۡرَافَنَافِيٓأَمۡرِنَاوَثَبِّتۡأَقۡدَامَنَاوَٱنصُرۡنَاعَلَىٱلۡقَوۡمِٱلۡكَٰفِرِينَ",
    "latin": "rabbana igh'fir lana dhunubana wa-is'rafana fi amrina wathabbit aqdamana wa-unsur'na ala al-qawmi al-kafirina",
    "translation": "Ya Tuhan kami, ampunilah dosa-dosa kami dan tindakan-tindakan kami yang berlebihan (dalam) urusan kami149) dan tetapkanlah pendirian kami, dan tolonglah kami terhadap orang-orang kafir",
    "notes": null,
    "fawaid": null,
	"source": "QS. Ali Imran 147"
  },
  {
    "title": "Doa Arafah #3",
    "arabic": "رَبَّنَآإِنَّنَآءَامَنَّافَٱغۡفِرۡلَنَاذُنُوبَنَاوَقِنَاعَذَابَٱلنَّارِ",
    "latin": "rabbana innana amanna fa-igh'fir lana dhunubana waqina adhabanar",
    "translation": "Ya Tuhan kami, kami benar-benar beriman, maka ampunilah dosa-dosa kami dan lindungilah kami dari azab neraka",
    "notes": null,
    "fawaid": null,
	"source": "QS. Ali Imran 16"
  }
]
