[
  {
    "title": "Doa Berbuka Puasa",
    "arabic": "ذَهَبَ الظَّمَأُ وَابْتَلَّتِ الْعُرُوقُ وَثَبَتَ الأَجْرُ إِنْ شَاءَ اللَّهُ",
    "latin": "Dzahabadh zhoma’u wabtallatil ‘uruqu wa tsabatal ajru insya Allah",
    "translation": "Rasa haus telah hilang dan urat-urat telah basah, dan pahala telah ditetapkan insya Allah",
    "notes": null,
    "fawaid": "",
    "source": "HR. Abu Daud no. 2357. Syaikh Al Albani mengatakan bahwa hadits ini hasan"
  },
  {
    "title": "Doa Berbuka Puasa di Tempat Orang Lain",
    "arabic": "أَفْطَرَ عِنْدَكُمُ الصَّائِمُونَ وَأَكَلَ طَعَامَكُمُ الأَبْرَارُ وَصَلَّتْ عَلَيْكُمُ الْمَلاَئِكَةُ",
    "latin": "Afthoro ‘indakumush shoo-imuuna wa akala tho’amakumul abroor wa shollat ‘alaikumul malaa-ikah",
    "translation": "Rasa haus telah hilang dan urat-urat telah basah, dan pahala telah ditetapkan insya Allah",
    "notes": null,
    "fawaid": "Nabi shallallahu ‘alaihi wa sallam ketika disuguhkan makanan oleh Sa’ad bin ‘Ubadah, beliau mengucapkan doa ini",
    "source": "HR. Abu Daud no. 3854 dan Ibnu Majah no. 1747 dan Ahmad 3/118. Syaikh Al Albani mengatakan bahwa hadits ini shahih."
  },
  {
    "title": "Doa Kepada Orang yang Memberi Makan dan Minum",
    "arabic": "اللَّهُمَّ أَطْعِمْ مَنْ أَطْعَمَنِى وَأَسْقِ مَنْ أَسْقَانِى",
    "latin": "Allahumma ath’im man ath’amanii wa asqi man asqoonii",
    "translation": "Ya Allah, berilah ganti makanan kepada orang yang memberi makan kepadaku dan berilah minuman kepada orang yang memberi minuman kepadaku",
    "notes": null,
    "fawaid": "Ketika Nabi shallallahu ‘alaihi wa sallam diberi minum, beliau pun mengangkat kepalanya ke langit dan mengucapkan doa ini",
    "source": "HR. Muslim no. 2055"
  },
  {
    "title": "Doa di Malam Lailatul Qadar",
    "arabic": "اللَّهُمَّ إِنَّكَ عَفُوٌّ تُحِبُّ الْعَفْوَ فَاعْفُ عَنِّى",
    "latin": "Allahumma innaka ‘afuwwun tuhibbul ‘afwa fa’fu anni",
    "translation": "Ya Allah, Engkau Maha Memberikan Maaf dan Engkau suka memberikan maaf(menghapus kesalahan), karenanya maafkanlah aku—hapuslah dosa(dosaku)",
    "notes": null,
    "fawaid": "Sangat dianjurkan untuk memperbanyak do’a ini pada lailatul qadar.",
    "source": "HR. Tirmidzi no. 3513, Ibnu Majah no. 3850, dan Ahmad 6/171. Syaikh Al Albani mengatakan bahwa hadits ini shahih"
  },
  {
    "title": "Dzikir Ketika Melihat Hilal",
    "arabic": "اللَّهُمَّ أَهْلِلْهُ عَلَيْنَا بِالْيُمْنِ وَالإِيمَانِ وَالسَّلاَمَةِ وَالإِسْلاَمِ رَبِّى وَرَبُّكَ اللَّهُ",
    "latin": "Allahumma ahlilhu ‘alayna bilyumni wal iimaani was salaamati wal islaami. Robbii wa Robbukallah.",
    "translation": "Ya Allah, tampakkanlah bulan itu kepada kami dengan membawa keberkahan dan keimanan, keselamatan dan Islam. Rabbku dan Rabbmu (wahai bulan sabit) adalah Allah",
    "notes": null,
    "fawaid": "",
    "source": "HR. Ahmad 1/162 dan Tirmidzi no. 3451, dan Ad Darimi. At Tirmidzi mengatakan bahwa hadits ini hasan ghorib. Syaikh Al Albani mengatakan bahwa hadits ini shahih."
  }
]
