[
  {
    "title": "Doa Sebelum Wudhu",
    "arabic": "بِسْمِ اللَّهِ",
    "latin": "Bismillaah",
    "translation": "Dengan nama Allah (aku berwudhu).",
    "notes": null,
    "fawaid": null,
    "source": "HR. Ibnu Majah no. 397"
  },
  {
    "title": "Doa Setelah Wudhu #1",
    "arabic": "أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ",
    "latin": "Asyhadu al-laa ilaaha illallaah wahdahu laa syariika lah, wa asyhadu anna muhammadan ‘abduhu wa rosuuluh.",
    "translation": "Aku bersaksi, bahwa tidak ada sesembahan yang berhak disembah kecuali Allah, Yang Maha Esa dan tiada sekutu bagiNya. Aku bersaksi, bahwa Muhammad adalah hamba dan utusanNya.”",
    "notes": null,
    "fawaid":null,
    "source": "HR. Muslim no. 234"
  },{
    "title": "Doa Setelah Wudhu #2",
    "arabic": "أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ، اللَّهُمَّ اجْعَلْنِي مِنَ التَّوَّابِينَ، وَاجْعَلْنِي مِنَ المُتَطَهِّرِينَ",
    "latin": "Asyhadu al-laa ilaaha illallaah wahdahu laa syariika lah, wa asyhadu anna muhammadan ‘abduhu wa rosuuluh Allaahummaj ‘alnii minat-tawwaabiina waj ‘alnii minal mutathohhiriin.",
    "translation": "Aku bersaksi, bahwa tidak ada sesembahan yang berhak disembah kecuali Allah, Yang Maha Esa dan tiada sekutu bagiNya. Aku bersaksi, bahwa Muhammad adalah hamba dan utusanNya. Ya Allah, jadikanlah aku termasuk orang-orang yang bertaubat dan jadikanlah aku termasuk orang-orang (yang senang) bersuci",
    "notes": null,
    "fawaid": null,
    "source": "HR. At-Tirmidzi no. 55, di shohihkan oleh Al-Albani"
  },{
    "title": "Doa Setelah Wudhu #3",
    "arabic": "سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ، أَشْهَدُ أَنْ لاَ إِلَـٰهَ إِلاَّ أَنْتَ، أَسْتَغْفِرُكَ، وَأَتُوْبُ إِلَيْكَ",
    "latin": "Subhaanakallaahumma wa bihamdika, asyhadu al-laa ilaaha illaa anta, astaghfiruka, wa atuubu ilaik.",
    "translation": "Maha Suci Engkau ya Allah, aku memujiMu. Aku bersaksi bahwa tidak ada sesembahan yang berhak disembah kecuali Engkau, aku minta ampun dan bertaubat kepada-Mu.",
    "notes": null,
    "fawaid": null,
    "source": "HR. An-Nasai dalam kitabnya ‘Amalul Yaumi wal Lailah no. 81. Ibnul Mulaqqin mengatakan hadits ini shohih dengan syarat Bukhori dan Muslim. (Lihat: Al-Badrul Munir 2/289)"
  }
]
