[
  {
    "title": "Doa Pergi Ke Masjid",
    "arabic": "اللهُمَّ اجْعَلْ فِي قَلْبِي نُورًا، وَفِي لِسَانِي نُورًا، وَاجْعَلْ فِي سَمْعِي نُورًا، وَاجْعَلْ فِي بَصَرِي نُورًا، وَاجْعَلْ مِنْ خَلْفِي نُورًا، وَمِنْ أَمَامِي نُورًا، وَاجْعَلْ مِنْ فَوْقِي نُورًا، وَمِنْ تَحْتِي نُورًا، اللهُمَّ أَعْطِنِي نُورًا",
    "latin": "Allaahummaj’al fii qolbii nuuron, wa fii lisaanii nuuron, waj’al fii sam’ii nuuron, waj’al fii bashorii nuuron, waj’al min kholfii nuuron, wa min amaamii nuuron, waj’al min fauqii nuuron, wa min tahtii nuuron, allaahumma a’thinii nuuron",
    "translation": "Ya Allah, jadikanlahlah cahaya di hatiku, cahaya di lidahku, cahaya di pendengaranku, cahaya di penglihatanku, cahaya dari belakangku, cahaya dari hadapanku, cahaya dari atasku, cahaya dari bawahku. Ya Allah, berilah aku cahaya.",
    "notes": "Masuk dengan mendahulukan kaki kanan",
    "fawaid": "Para ulama mengatakan maksud dari permintaan agar diberikan cahaya pada anggota tubuhnya dan arah yang dituju adalah permintaan untuk diberikan penjelasan tentang yang Haq, meminta ridho-Nya dan meminta agar diberikan petunjuk agar bisa menempuhnya. (lihat: Syarhu As-Suyuthi ‘Alaa Muslim 2/373).",
    "source": "HR. Muslim no. 763 (6/225)"
  },
  {
    "title": "Doa Masuk Masjid #1",
    "arabic": "بِسْمِ اللَّهِ وَالسَّلاَمُ عَلَى رَسُولِ اللَّهِ اللَّهُمَّ اغْفِرْ لِى ذُنُوبِى وَافْتَحْ لِى أَبْوَابَ رَحْمَتِكَ",
    "latin": "bismillah wassalaamu ‘ala rosulillah. allohummaghfir lii dzunuubi waftahlii abwaaba rohmatik",
    "translation": "Dengan menyebut nama Allah dan salam atas Rasulullah. Ya Allah, ampunilah dosa-dosaku dan bukakanlah kepadaku pintu rahmat-Mu.",
    "notes": "Masuk dengan mendahulukan kaki kanan",
    "fawaid": "Masjid adalah rumah Allah, hendaknya seorang hamba mengagungkannya dan berharap rahmat Allah di dalamnya.",
    "source": "HR. Ibnu Majah, no. 771 dan Tirmidzi, no. 314. Syaikh Al-Albani mengatakan bahwa hadits ini shahih"
  },
  {
    "title": "Doa Masuk Masjid #2",
    "arabic": "اَللَّهُمَّ افْتَحْ لِيْ أَبْوَابَ رَحْمَتِكَ",
    "latin": "allahummaftah lii abwaaba rahmatika",
    "translation": "Ya Allah, bukalah pintu-pintu rahmat-Mu untukku.",
    "notes":  "Masuk dengan mendahulukan kaki kanan",
    "fawaid": "Masjid adalah rumah Allah, hendaknya seorang hamba mengagungkannya dan berharap rahmat Allah di dalamnya.",
    "source": "HR. Muslim No. 713"
  },
  {
    "title": "Doa Masuk Masjid #3",
    "arabic": "أَعُوذُ بِاللَّهِ الْعَظِيمِ وَبِوَجْهِهِ الْكَرِيمِ وَسُلْطَانِهِ الْقَدِيمِ مِنَ الشَّيْطَانِ الرَّجِيمِ",
    "latin": "A'uudzu billahil Azhim wa bi Wajhihil Karim wa Shulthanihil Qadim minasy syaithanirrajim",
    "translation": "Aku berlindung kepada Allah yang Maha Agung dan kepada Wajah-Nya yang Maha Mulia dan kepada kekuasaan-Nya yang Qadim, dari gangguan syetan yang terkutuk.",
    "notes":  "Masuk dengan mendahulukan kaki kanan",
    "fawaid": "Nabi shallallahu 'alaihi wasallam, bahwasanya beliau apabila masuk ke masjid mengucapkan: A'uudzu billahil Azhim wa bi Wajhihil Karim wa Shulthanihil Qadim minasy syaithanirrajim (aku berlindung kepada Allah yang Maha Agung dan kepada Wajah-Nya yang Maha Mulia dan kepada kekuasaan-Nya yang Qadim, dari gangguan syetan yang terkutuk). Dia bertanya; Apakah itu saja? Aku menjawab: Ya! Dia kemudian meneruskan; Barangsiapa membaca itu, maka syetan akan berkata kepadanya; Dia terjaga dariku sehari ini penuh.",
    "source": "H.R. Abu Dawud no.466 dan dishahihkan oleh Al-Albani"
  },
  {
    "title": "Doa Keluar Masjid #1",
    "arabic": "بِسْمِ اللَّهِ وَالسَّلاَمُ عَلَى رَسُولِ اللَّهِ اللَّهُمَّ اغْفِرْ لِى ذُنُوبِى وَافْتَحْ لِى أَبْوَابَ فَضْلِكَ",
    "latin": "bismillah wassalaamu ‘ala rosulillah. allohummaghfir lii dzunuubi waftahlii abwabaa fadhlik",
    "translation": "Dengan menyebut nama Allah dan salam atas Rasulullah. Ya Allah, ampunilah dosa-dosaku dan bukakanlah padaku pintu karunia-Mu.",
    "notes":  "Keluar dengan mendahulukan kaki kiri",
    "fawaid": "Bumi Allah sangatlah luas, ada banyak jalan mencari rezeki. Hendalkah seorang hamba meminta karunia kepada Allah agar dimudahkan untuk mendapat rezeki yang telah Allah bagikan kepada seluruh hamba-Nya.",
    "source": "HR. Ibnu Majah, no. 771 dan Tirmidzi, no. 314. Syaikh Al-Albani mengatakan bahwa hadits ini shahih"
  },
  {
    "title": "Doa Keluar Masjid #2",
    "arabic": "اَللَّهُمَّ إِنِّيْ أَسْأَلُكَ مِنْ فَضْلِكَ",
    "latin": "allahumma innii as'aluka min fadhlika",
    "translation": "Ya Allah, sesungguhnya aku memohon karunia-Mu.",
    "notes": "Keluar dengan mendahulukan kaki kiri",
    "fawaid": "Bumi Allah sangatlah luas, ada banyak jalan mencari rezeki. Hendalkah seorang hamba meminta karunia kepada Allah agar dimudahkan untuk mendapat rezeki yang telah Allah bagikan kepada seluruh hamba-Nya.",
    "source": "HR. Muslim No. 713"
  }
]
